In [123]:
# Exemplo de tabela

import pandas as pd
tabelaValores = {
    'Curso':['Eletroeletônica', 'Desenvolvimento de Sistemas', 'Mecânica', 'Redes'],
    'Escola_Senai':['Jandira','Barueri','Osasco','Leopoldina'],
    'Vagas':[32,32,64,16],
}

criandoDataFrame = pd.DataFrame(tabelaValores, columns=['Curso','Escola_Senai', 'Vagas'])
criandoDataFrame

                         Curso Escola_Senai  Vagas
0              Eletroeletônica      Jandira     32
1  Desenvolvimento de Sistemas      Barueri     32
2                     Mecânica       Osasco     64
3                        Redes   Leopoldina     16

In [124]:
# Se eu quero apenas alguns primeiros elementos do DataFrame .head() -> pode colocar o index que quiser dentro do ()
criandoDataFrame.head(2)

                         Curso Escola_Senai  Vagas
0              Eletroeletônica      Jandira     32
1  Desenvolvimento de Sistemas      Barueri     32

In [125]:
# Se eu quero apenas os ultimos elementos do meu DataFrame .tail() -> pode colocar a quantidade de elementos finais ()
criandoDataFrame.tail(1)

   Curso Escola_Senai  Vagas
3  Redes   Leopoldina     16

In [126]:
# .shape passa as informações sobre o DataFrame (linhas, colunas)
criandoDataFrame.shape

(4, 3)

In [90]:
# .index passa a descrição do index (indice)
criandoDataFrame.index

RangeIndex(start=0, stop=4, step=1)

In [91]:
# .count faz a contagem de dados não nulos(ausentes)
criandoDataFrame.count

<bound method DataFrame.count of                          Curso Escola_Senai  Vagas
0              Eletroeletônica      Jandira     32
1  Desenvolvimento de Sistemas      Barueri     32
2                     Mecânica       Osasco     64
3                        Redes   Leopoldina     16>

In [92]:
    # Criando uma nova coluna no DataFrame

    criandoDataFrame['Nota_aprovacao'] = None
    criandoDataFrame['Ausentes'] = None
    criandoDataFrame

                         Curso Escola_Senai  Vagas Nota_aprovacao Ausentes
0              Eletroeletônica      Jandira     32           None     None
1  Desenvolvimento de Sistemas      Barueri     32           None     None
2                     Mecânica       Osasco     64           None     None
3                        Redes   Leopoldina     16           None     None

In [93]:
# Criando uma nova coluna no DataFrame

criandoDataFrame.drop(columns=['Ausentes'])
criandoDataFrame

                         Curso Escola_Senai  Vagas Nota_aprovacao Ausentes
0              Eletroeletônica      Jandira     32           None     None
1  Desenvolvimento de Sistemas      Barueri     32           None     None
2                     Mecânica       Osasco     64           None     None
3                        Redes   Leopoldina     16           None     None

In [102]:
# Percebeu que não mudou nada no DataFrame? Isso se dá pois devemos criar uma nova variavel

# Criando uma nova variavel e aplicando a função .drop(columns=[])

novoData = criandoDataFrame
novoData = novoData.drop(columns=['Ausentes'])
novoData

                         Curso Escola_Senai  Vagas Nota_aprovacao
0              Eletroeletônica      Jandira     32           None
1  Desenvolvimento de Sistemas      Barueri     32           None
2                     Mecânica       Osasco     64           None
3                        Redes   Leopoldina     16           None

In [103]:
# Adicionando valores no DataFrame
novoData.loc[0,'Nota_aprovacao'] = 120
novoData.loc[1,'Nota_aprovacao'] = 150
novoData.loc[2,'Nota_aprovacao'] = 90
novoData.loc[3,'Nota_aprovacao'] = 120
novoData

                         Curso Escola_Senai  Vagas Nota_aprovacao
0              Eletroeletônica      Jandira     32            120
1  Desenvolvimento de Sistemas      Barueri     32            150
2                     Mecânica       Osasco     64             90
3                        Redes   Leopoldina     16            120

In [115]:
# Adicionando uma nova linha no DataFrame

novoData.loc[4,:] = ['Gráfica','Barueri',30,100]
novoData

                         Curso Escola_Senai  Vagas Nota_aprovacao
0              Eletroeletônica      Jandira   32.0            120
1  Desenvolvimento de Sistemas      Barueri   32.0            150
2                     Mecânica       Osasco   64.0             90
3                        Redes   Leopoldina   16.0            120
4                      Gráfica      Barueri   30.0            100

In [97]:
# Operadores lógicos 
# & -> and
# | -> or
#

In [99]:
# Adicionando filtros para nosso DataFrame com & (filtrando valores)

filtroData = novoData[(novoData['Nota_aprovacao'] >= 120) & (novoData['Vagas'] >= 32)]
filtroData

                         Curso Escola_Senai  Vagas Nota_aprovacao
0              Eletroeletônica      Jandira   32.0            120
1  Desenvolvimento de Sistemas      Barueri   32.0            150

In [100]:
# Filtro feito com OR | tendo aprovações diferentes quando usamos o & AND

filtroData = novoData[(novoData['Nota_aprovacao'] > 100) | (novoData['Vagas'] >= 32)]
filtroData

                         Curso Escola_Senai  Vagas Nota_aprovacao
0              Eletroeletônica      Jandira   32.0            120
1  Desenvolvimento de Sistemas      Barueri   32.0            150
2                     Mecânica       Osasco   64.0             90
3                        Redes   Leopoldina   16.0            120

In [101]:
# Podemos usar o .query() mas não deve-se usar o operador lógico, tem que escrever em forma de string.

novoData.query('Nota_aprovacao>=120 and Vagas >=32')
novoData

                         Curso Escola_Senai  Vagas Nota_aprovacao
0              Eletroeletônica      Jandira   32.0            120
1  Desenvolvimento de Sistemas      Barueri   32.0            150
2                     Mecânica       Osasco   64.0             90
3                        Redes   Leopoldina   16.0            120
4                      Gráfica      Barueri   30.0            100

In [108]:
# Desvio padrão entre Vagas e Nota_aprovacao
desvioData = novoData.std(axis=0)
desvioData

C:\Users\Cris\AppData\Local\Temp/ipykernel_18180/3135489506.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  desvioData = novoData.std(axis=0)

Vagas             17.640862
Nota_aprovacao    23.021729
dtype: float64

In [109]:
filtroData = novoData[(novoData['Nota_aprovacao'] > 100) | (novoData['Vagas'] >= 32)].std(axis=0)
filtroData

C:\Users\Cris\AppData\Local\Temp/ipykernel_18180/2503928999.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  filtroData = novoData[(novoData['Nota_aprovacao'] > 100) | (novoData['Vagas'] >= 32)].std(axis=0)

Vagas             20.132892
Nota_aprovacao    24.494897
dtype: float64

In [111]:
!pip install seaborn

Collecting seaborn

WARNING: You are using pip version 21.1.3; however, version 21.2.4 is available.
You should consider upgrading via the 'c:\users\cris\appdata\local\programs\python\python39\python.exe -m pip install --upgrade pip' command.

  Downloading seaborn-0.11.2-py3-none-any.whl (292 kB)
Requirement already satisfied: pandas>=0.23 in c:\users\cris\appdata\local\programs\python\python39\lib\site-packages (from seaborn) (1.3.1)
Requirement already satisfied: matplotlib>=2.2 in c:\users\cris\appdata\local\programs\python\python39\lib\site-packages (from seaborn) (3.4.2)
Collecting scipy>=1.0
  Downloading scipy-1.7.1-cp39-cp39-win_amd64.whl (33.8 MB)
Requirement already satisfied: numpy>=1.15 in c:\users\cris\appdata\local\programs\python\python39\lib\site-packages (from seaborn) (1.21.1)
Requirement already satisfied: cycler>=0.10 in c:\users\cris\appdata\local\programs\python\python39\lib\site-packages (from matplotlib>=2.2->seaborn) (0.10.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\cris\appdata\local\programs\python\python39\lib\site-packages (from matplotlib>=2.2->seaborn) (1.3.1)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\cris\appdata\local\programs\python\python39\lib\site-packages (from matplotlib>=2.2->seaborn) (2.8.1)
Requirement already satisfied: pillow>=6.2.0 in c:\users\cris\appdata\local\programs\python\python39\lib\site-packages (from matplotlib>=2.2->seaborn) (8.3.1)
Requirement already satisfied: pyparsing>=2.2.1 in c:\users\cris\appdata\local\programs\python\python39\lib\site-packages (from matplotlib>=2.2->seaborn) (2.4.7)
Requirement already satisfied: six in c:\users\cris\appdata\local\programs\python\python39\lib\site-packages (from cycler>=0.10->matplotlib>=2.2->seaborn) (1.16.0)
Requirement already satisfied: pytz>=2017.3 in c:\users\cris\appdata\local\programs\python\python39\lib\site-packages (from pandas>=0.23->seaborn) (2021.1)
Installing collected packages: scipy, seaborn
Successfully installed scipy-1.7.1 seaborn-0.11.2

In [121]:
# Pra salvar o arquivo final, basta utlizar .to_csv()

novoData.to_csv('Tabela_de_Cursos.csv', sep='\t', index=False)